GetPrimaryViewId Method
 Get the id of the primary view.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2013
 Syntax
  C#
public ElementId GetPrimaryViewId()
  Visual Basic
Public Function GetPrimaryViewId As ElementId
  Visual C++
public:
ElementId^ GetPrimaryViewId()
 Return Value
 The id of the primary view, or InvalidElementId if there is no primary view.
 Remarks
 The primary view is the view from which a dependent view is created.
 See Also
  View Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →